# Finding our best-performing salespeople and products

## Introduction

**Business Context.** You work for AdventureWorks, a company that sells outdoor sporting equipment. The company has many different locations and has been recording the sales of different locations on various products. You, their new data scientist, have been tasked with the question: **"What are our best products and salespeople and how can use this information to improve our overall performance?"**

You have been given access to the relevant data files with documentation from the IT department. Your job is to extract meaningful insights from these data files to help increase sales. First, you will look at the best products and try to see how different products behave in different categories. Second, you will analyze the best salespeople to see if the commission percentage motivates them to sell more.

**Business Problem.** Your task is to **construct a database from the provided CSV files and then write queries in SQL to carry out the requested analysis**.

**Analytical Context.** You are given the data (stored in the ```data/csvs``` folder) as a set of separate CSV files, each one representing a table. You will build a new PostgreSQL database from these files using AWS RDS.

The company has been pretty vague about how they expect you to extract insights, but you have come up with the following plan of attack:

1. Create the database and ensure you can run basic queries against it
2. Look at how product ratings and total sales are related
3. See how products sell in different subcategories (bikes, helmets, socks, etc.)
4. Calculate which salespeople have performed the best in the past year
5. Seeing if total sales are correlated with their commission percentage

Of course, this is only your initial plan. As you explore the database, your strategy will change.

## Setting up AWS

In this case, we'll assume that the company has given you an entry-level laptop, which is not capable of running a PostgreSQL server locally. Therefore, you should set up a cloud database, connect to it from `psql`, and run the analysis via the `psql` or directly from the notebook.

### Question:

Repeat the steps in Case 12.3 to create a new RDS instance with a PostgreSQL database.

## Overview of the data

The data for the case is contained in the ```./data/csvs``` directory; specifically, it is the ```AdventureWorks``` sample data provided by Microsoft. We will be focusing on the Sales and Production categories. Complete documentation for the original data (of which you have only a subset) can be found [here](https://dataedo.com/download/AdventureWorks.pdf). 

**Product Tables:**
* **Product**: one row per product that the company sells
* **ProductReview**: one row per rating and review left by customers
* **ProductModelProductDescriptionCulture**: a link between products and their longer descriptions also indicating a "culture" - which language and region the product is for
* **ProductDescription**: a longer description of each product, for a specific region
* **ProductCategory**: the broad categories that products fit into
* **ProductSubCategory**: the narrower subcategories that products fit into

**Sales Tables:**
* **SalesPerson**: one row per salesperson, including information on their commission and performance
* **SalesOrderHeader**: one row per sale summarizing the sale
* **SalesOrderDetail**: many rows per sale, detailing each product that forms part of the sale
* **SalesTerritory**: the different territories where products are sold, including performance

**Region Tables:**
* **CountryRegionCurrency**: the currency used by each region
* **CurrencyRate**: the average and closing exchange rates for each currency compared to the USD

## Setting up `ipython-sql` and `pgspecial`

Jupyter notebook is usually used to run Python code, but with an add-on it can run SQL directly against a database too. Install the extensions `ipython-sql` and `pgspecial` through `pip` (you may have to restart the notebook after doing this) and create the database `adventureworks`:

In [1]:
!pip3 install ipython-sql pgspecial

Requirement already satisfied: ipython-sql in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (0.4.0)

You are using pip version 19.0.3, however version 20.2b1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

Requirement already satisfied: pgspecial in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (1.11.10)
Requirement already satisfied: sqlparse in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: prettytable<1 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython-sql) (1.12.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython-sql) (1.3.17)
Requirement already satisfied: ipython>=1.0 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython-sql) (7.15.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: click>=4.1 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from pgspecial) (7.0)
Requirement already satisfied: psycopg2>=2.7.4 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from pgspecial) (2.8.5)
Requirement already satisfied: jedi>=0.10 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: pickleshare in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython>=1.0->ipython-sql) (0.3.9)
Requirement already satisfied: backcall in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython>=1.0->ipython-sql) (40.6.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: traitlets>=4.2 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: pygments in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\pedro.ospina\appdata\local\programs\python\python37-32\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)

Now load the sql add-on and connect to the database as follows. You'll need to change the username (`postgres`), password (`mysecretpassword`), host (`localhost`), and database name (`postgres`) to what you used when setting up your RDS instance:

In [2]:
%load_ext sql
%sql postgresql://postgres:jbsz4B7NRGVR83d0hYZy@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime

You should now be able to run SQL directly from any Jupyter notebook cell by starting the cell with a line that states `%%sql`. For example (once you have a database with some tables, which we'll only create later):

```sql
%%sql

SELECT * FROM product LIMIT 10;
```

**Note:** Unlike `pandas` which automatically truncates output for large DataFrames, the SQL plug-in gives you exactly what you ask for. If you do a `SELECT * FROM` a table with a million rows and no `LIMIT` clause, it'll output all million rows and probably freeze your notebook. It's good practice to always use a `LIMIT` clause even when it's not needed to avoid any mishaps.

## Creating the database and adding the tables

Now, let's create a database called `adventuretime`. (If you do this through the notebook, you'll have to add the line `end;` before your `create database` command as the add-on runs everything in transactions).

You'll need to add a table for each of the CSV files. Spend some time looking at the different CSV files and getting used to how they reference each other and what headers they create. Then, you'll need to write an appropriate `CREATE TABLE` command with appropriate types. You can figure out the types by inspecting the CSV files and/or referencing the documentation.

### Exercise 1:

Write all of the commands that you need to

* Create the database
* Create the tables
* Import the data from the CSVs

**Hint:** As an example, to add data for the `salesperson` table, you would use the following commands:

1. Create table (can be run from Jupyter Notebook or the `psql` command line interface):
```sql
CREATE TABLE salesperson (
    businessentityid INTEGER,
    territoryid INTEGER,
    salesquota INTEGER,
    bonus INTEGER,
    commissionpct FLOAT,
    salesytd FLOAT,
    saleslastyear FLOAT,
    rowguid TEXT,
    modifieddate DATE
    );
```

2. Copy data (has to be run from the `psql` shell):

```sql
\copy salesperson FROM 'data/csvs/salesperson.csv' with (format CSV, header true, delimiter ',');
```

**Answer.**

Creating schema

In [115]:
import pandas as pd

df = pd.read_csv("data/csvs/salesterritory.csv")
df.info()
print(df["countryregioncode"].unique())
print(max(df["name"].str.len()))
df.head().loc[:,:]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   territoryid        10 non-null     int64
 1   name               10 non-null     object
 2   countryregioncode  10 non-null     object
 3   group              10 non-null     object
 4   salesytd           10 non-null     float64
 5   saleslastyear      10 non-null     float64
 6   costytd            10 non-null     int64
 7   costlastyear       10 non-null     int64
 8   rowguid            10 non-null     object
 9   modifieddate       10 non-null     object
dtypes: float64(2), int64(3), object(5)
memory usage: 928.0+ bytes
['US' 'CA' 'FR' 'DE' 'AU' 'GB']
14

,territoryid,name,countryregioncode,group,salesytd,saleslastyear,costytd,costlastyear,rowguid,modifieddate
0,1,Northwest,US,North America,7.887187e+06,3.298694e+06,0,0,43689a10-e30b-497f-b0de-11de20267ff7,2008-04-30 00:00:00
1,2,Northeast,US,North America,2.402177e+06,3.607149e+06,0,0,00fb7309-96cc-49e2-8363-0a1ba72486f2,2008-04-30 00:00:00
2,3,Central,US,North America,3.072175e+06,3.205014e+06,0,0,df6e7fd8-1a8d-468c-b103-ed8addb452c1,2008-04-30 00:00:00
3,4,Southwest,US,North America,1.051085e+07,5.366576e+06,0,0,dc3e9ea0-7950-4431-9428-99dbcbc33865,2008-04-30 00:00:00
4,5,Southeast,US,North America,2.538667e+06,3.925071e+06,0,0,6dc4165a-5e4c-42d2-809d-4344e0ac75e7,2008-04-30 00:00:00

```sql

CREATE TABLE salesperson (
	businessentityid INTEGER,
	territoryid INTEGER,
	salesquota INTEGER,
	bonus INTEGER,
	commissionpct FLOAT,
	salesytd FLOAT,
	saleslastyear FLOAT,
	rowguid TEXT,
	modifieddate DATE
);

CREATE TABLE CountryRegionCurrency(
	countryregioncode VARCHAR(3),
	currencycode VARCHAR(3),
	modifieddate DATE
);

CREATE TABLE CurrencyRate(
	currencyrateid INT,
	currencyrateDate DATE,
	fromcurrencycode VARCHAR(3),
	tocurrencycode VARCHAR(3),
	averagerate FLOAT,
	endofdayrate FLOAT,
	modifieddate DATE
);

CREATE TABLE Product(
	productid INT,
	name VARCHAR(40),
	productnumber VARCHAR(10),
	makeflag VARCHAR(1),
	finishedgoodsflag VARCHAR(1),
	color VARCHAR(30),
	safetystocklevel INT,
	reorderpoint INT,
	standardcost FLOAT,
	listprice FLOAT,
	size VARCHAR(10),
	sizeunitmeasurecode VARCHAR(10),
	weightunitmeasurecode VARCHAR(10),
	weight FLOAT,
	daystomanufacture INT,
	productline VARCHAR(10),
	class VARCHAR(10),
	style VARCHAR(10),
    productsubcategoryid INT,
	productmodelid INT,
	sellstartdate DATE,
	sellenddate DATE,
	discontinueddate DATE,
	rowguid TEXT,
	modifieddate DATE
);

CREATE TABLE productcategory(
	productcategoryid INT,
	name VARCHAR(30),
	rowguid	TEXT,
	modifieddate DATE
);


CREATE TABLE productdescription(
	productdescriptionid INT,
	description VARCHAR(300),
	rowguid	TEXT,
	modifieddate DATE
);

CREATE TABLE productmodelproductdescriptionculture (
	productmodelid INT,
	productdescriptionid INT,
	cultureid VARCHAR(10),
	modifieddate DATE
);

CREATE TABLE productreview(
	productreviewid INT,
	productid INT,
	reviewername VARCHAR(30),
	reviewdate DATE,
	emailaddress VARCHAR(50),
	rating INT,
	comments VARCHAR(4000),
	modifieddate DATE
);

CREATE TABLE productsubcategory(
	productsubcategoryid INT,
	productcategoryid INT,
    name VARCHAR(30),
	rowguid TEXT,
	modifieddate DATE
);

CREATE TABLE salesorderdetail (
	salesorderid INT,
	salesorderdetailid INT,
	carriertrackingnumber VARCHAR(20),
	orderqty INT,
	productid INT,
	specialofferid INT,
	unitprice FLOAT,
	unitpricediscount FLOAT,
	rowguid TEXT,
	modifieddate DATE
);

CREATE TABLE salesorderheader (
	salesorderid INT,
	revisionnumber INT,
	orderdate DATE,
	duedate DATE,
	shipdate DATE,
	status INT,
	onlineorderflag VARCHAR(2),
	purchaseordernumber VARCHAR(30),
	accountnumber VARCHAR(30),
	customerid INT,
	salespersonid INT,
	territoryid INT,
	billtoaddressid INT,
	shiptoaddressid INT,
	shipmethodid INT,
	creditcardid FLOAT,
	creditcardapprovalcode VARCHAR(30),
	currencyrateid FLOAT,
	subtotal FLOAT,
	taxamt FLOAT,
	freight FLOAT,
	totaldue FLOAT,
	comment VARCHAR(100),
	rowguid TEXT,
	modifieddate DATE
);

CREATE TABLE salesterritory(
	territoryid INT,
	name VARCHAR(30),
	countryregioncode VARCHAR(3),
	groupname VARCHAR(20),
	salesytd FLOAT,
	saleslastyear FLOAT,
	costytd INT,
	costlastyear INT,
	rowguid TEXT,
	modifieddate DATE	
);

```

To clean tables, just in case that populate script needs to be re-executed.

In [126]:

%%sql    
DELETE FROM countryregioncurrency;
DELETE FROM currencyrate;
DELETE FROM product;
DELETE FROM productcategory;
DELETE FROM productdescription;
DELETE FROM productmodelproductdescriptionculture;
DELETE FROM productreview;
DELETE FROM productsubcategory;
DELETE FROM salesorderdetail;
DELETE FROM salesorderheader;
DELETE FROM salesperson;
DELETE FROM salesterritory;

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
(psycopg2.OperationalError) server closed the connection unexpectedly
	This probably means the server terminated abnormally
	before or while processing the request.

[SQL: DELETE FROM countryregioncurrency;]
(Background on this error at: http://sqlalche.me/e/e3q8)

Populating tables

In [ ]:
%%sql
\copy countryregioncurrency FROM 'data/csvs/countryregioncurrency.csv' with (format CSV, header true, delimiter ',');
\copy currencyrate FROM 'data/csvs/currencyrate.csv' with (format CSV, header true, delimiter ',');
\copy product FROM 'data/csvs/product.csv' with (format CSV, header true, delimiter ',');
\copy productcategory FROM 'data/csvs/productcategory.csv' with (format CSV, header true, delimiter ',');
\copy productdescription FROM 'data/csvs/productdescription.csv' with (format CSV, header true, delimiter ',');
\copy productmodelproductdescriptionculture FROM 'data/csvs/productmodelproductdescriptionculture.csv' with (format CSV, header true, delimiter ',');
\copy productreview FROM 'data/csvs/productreview.csv' with (format CSV, header true, delimiter ',');
\copy productsubcategory FROM 'data/csvs/productsubcategory.csv' with (format CSV, header true, delimiter ',');
\copy salesorderdetail FROM 'data/csvs/salesorderdetail.csv' with (format CSV, header true, delimiter ',');
\copy salesorderheader FROM 'data/csvs/salesorderheader.csv' with (format CSV, header true, delimiter ',');
\copy salesperson FROM 'data/csvs/salesperson.csv' with (format CSV, header true, delimiter ',');
\copy salesterritory FROM 'data/csvs/salesterritory.csv' with (format CSV, header true, delimiter ',');

In [112]:

%%sql
SELECT * FROM salesterritory LIMIT 10

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
10 rows affected.

[(1, 'Northwest', 'US', 'North America', 7887186.7882, 3298694.4938, 0, 0, '43689a10-e30b-497f-b0de-11de20267ff7', datetime.date(2008, 4, 30)),
 (2, 'Northeast', 'US', 'North America', 2402176.8476, 3607148.9371, 0, 0, '00fb7309-96cc-49e2-8363-0a1ba72486f2', datetime.date(2008, 4, 30)),
 (3, 'Central', 'US', 'North America', 3072175.118, 3205014.0767, 0, 0, 'df6e7fd8-1a8d-468c-b103-ed8addb452c1', datetime.date(2008, 4, 30)),
 (4, 'Southwest', 'US', 'North America', 10510853.8739, 5366575.7098, 0, 0, 'dc3e9ea0-7950-4431-9428-99dbcbc33865', datetime.date(2008, 4, 30)),
 (5, 'Southeast', 'US', 'North America', 2538667.2515, 3925071.4318, 0, 0, '6dc4165a-5e4c-42d2-809d-4344e0ac75e7', datetime.date(2008, 4, 30)),
 (6, 'Canada', 'CA', 'North America', 6771829.1376, 5693988.86, 0, 0, '06b4af8a-1639-476e-9266-110461d66b00', datetime.date(2008, 4, 30)),
 (7, 'France', 'FR', 'Europe', 4772398.3078, 2396539.7601, 0, 0, 'bf806804-9b4c-4b07-9d19-706f2e689552', datetime.date(2008, 4, 30)),
 (8, 'Germany', 'DE', 'Europe', 3805202.3478, 1307949.7917, 0, 0, '6d2450db-8159-414f-a917-e73ee91c38a9', datetime.date(2008, 4, 30)),
 (9, 'Australia', 'AU', 'Pacific', 5977814.9154, 2278548.9776, 0, 0, '602e612e-dfe9-41d9-b894-27e489747885', datetime.date(2008, 4, 30)),
 (10, 'United Kingdom', 'GB', 'Europe', 5012905.3656, 1635823.3967, 0, 0, '05fc7e1f-2dea-414e-9ecd-09d150516fb5', datetime.date(2008, 4, 30))]

---------

## Finding our most popular products

As discussed, the company would like to know which of their products is the most popular among customers. You figure that the average rating given in reviews is correlated with the number of sales of a particular product (that products with higher reviews have more sales).

### Exercise 2:

Using the ```product``` and ```productreview``` tables, ```JOIN``` them and rank the products according to their average review rating. What are the names and IDs of the top 5 products?

**Answer.**

In [147]:
%%sql
SELECT p.name as ProductName,round(avg(pr.rating),1) AS AvgRating FROM product AS p
INNER JOIN productreview AS pr ON p.productid = pr.productid
GROUP BY p.name
ORDER BY AvgRating DESC
LIMIT 10;

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[('Mountain Bike Socks, M', Decimal('5.0')),
 ('Road-550-W Yellow, 40', Decimal('5.0')),
 ('HL Mountain Pedal', Decimal('3.0'))]

---------

### Exercise 3:

Much to your disappointment, there are only three products with ratings and only four reviews in total! This is nowhere near enough to perform an analysis of the correlation between reviews and total sales.

Nevertheless, your manager wants the **English description** of these products for an upcoming sale. Use the documentation provided above if you need help navigating the structure to extract this!

**Hint:** You'll notice that the value for `cultureid` in the `productmodelproductdescriptionculture` table often has extra trailing spaces which makes it difficult to reliably get descriptions of a specific language. You should first modify this table before writing the `SELECT` statement to get the descriptions that your manager wants. To do this, you can use an `UPDATE` statement with Postgres's [`TRIM`](https://w3resource.com/PostgreSQL/trim-function.php) function.

**Answer.**

In [148]:
%%sql
UPDATE productmodelproductdescriptionculture SET cultureid = TRIM(cultureid)

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
762 rows affected.

[]

In [149]:
%%sql 
SELECT pr.*, pd.description
FROM productmodelproductdescriptionculture as dc
INNER JOIN product as p on p.productmodelid = dc.productmodelid
INNER JOIN productdescription as pd ON pd.productdescriptionid = dc.productdescriptionid
INNER JOIN (
	SELECT p.productid, p.name as ProductName,round(avg(pr.rating),1) AS AvgRating 
	FROM product AS p
	INNER JOIN productreview AS pr ON p.productid = pr.productid
	GROUP BY p.productid,p.name
   ) as pr ON pr.productid = p.productid
WHERE cultureid = 'en'

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(798, 'Road-550-W Yellow, 40', Decimal('5.0'), 'Same technology as all of our Road series bikes, but the frame is sized for a woman.  Perfect all-around bike for road or racing.'),
 (937, 'HL Mountain Pedal', Decimal('3.0'), 'Stainless steel; designed to shed mud easily.'),
 (709, 'Mountain Bike Socks, M', Decimal('5.0'), 'Combination of natural and synthetic fibers stays dry and provides just the right cushioning.')]

---------

### Exercise 4:

Since we cannot infer the most popular products from the reviews, we will go with an alternative strategy.

Get the model ID, name, description, and total number of sales for each product and display the top-10 selling products. You can infer how often products have been sold by looking at the `salesorderdetail` table (each row might indicate more than one sale, so take note of `OrderQty`).

**Answer.**

In [150]:

%%sql
SELECT p.productmodelid as id, p.name, pd.description, SUM(od.orderqty) as soldProducts
FROM product as p
INNER JOIN salesorderdetail od ON p.productid = od.productid
INNER JOIN productmodelproductdescriptionculture as dc on p.productmodelid = dc.productmodelid AND dc.cultureid = 'en'
INNER JOIN productdescription as pd ON pd.productdescriptionid = dc.productdescriptionid
GROUP BY id,name,description
ORDER BY soldProducts DESC
LIMIT 10;

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
10 rows affected.

[(2, 'AWC Logo Cap', 'Traditional style with a flip-up brim; one-size fits all.', 8311),
 (111, 'Water Bottle - 30 oz.', 'AWC logo water bottle - holds 30 oz; leak-proof.', 6815),
 (33, 'Sport-100 Helmet, Blue', 'Universal fit, well-vented, lightweight , snap-on visor.', 6743),
 (11, 'Long-Sleeve Logo Jersey, L', 'Unisex long-sleeve AWC logo microfiber cycling jersey', 6592),
 (33, 'Sport-100 Helmet, Black', 'Universal fit, well-vented, lightweight , snap-on visor.', 6532),
 (33, 'Sport-100 Helmet, Red', 'Universal fit, well-vented, lightweight , snap-on visor.', 6266),
 (1, 'Classic Vest, S', 'Light-weight, wind-resistant, packs to fit into a pocket.', 4247),
 (114, 'Patch Kit/8 Patches', 'Includes 8 different size patches, glue and sandpaper.', 3865),
 (32, 'Short-Sleeve Classic Jersey, XL', 'Short sleeve classic breathable jersey with superior moisture control, front zipper, and 3 back pockets.', 3864),
 (11, 'Long-Sleeve Logo Jersey, M', 'Unisex long-sleeve AWC logo microfiber cycling jersey', 3636)]

---------

### Exercise 5:

Let's look at the correlation between quantity sold and price for each item in each subcategory. Some subcategories don't have enough sales to make the correlation meaningful, so only look at the top 10 subcategories by total quantity of sales.

Once you've looked at the data, make a hypothesis about what causes any positive or negative correlations between price and quantity, and explain this in 2-3 sentences.

**Hint:** You'll need to calculate the total quantities from `salesorderdetail` again and group the products by subcategory. It'll probably be easier if you use at least two [CTEs](https://www.postgresql.org/docs/9.1/queries-with.html). You can calculate the correlation in PostgreSQL by using the built-in [```corr()```](https://www.postgresql.org/docs/9.4/functions-aggregate.html) function.

**Answer.**

In [151]:
%%sql
WITH subproductSold AS (
	SELECT p.productsubcategoryid, SUM(od.orderqty) as soldProducts
	FROM product as p
	INNER JOIN salesorderdetail od ON p.productid = od.productid
	GROUP BY p.productsubcategoryid
	ORDER BY soldProducts DESC
	LIMIT 10
)
SELECT corr(p.listprice,ss.soldProducts)
FROM product as p
INNER JOIN subproductSold as ss ON p.productsubcategoryid = ss.productsubcategoryid

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
1 rows affected.

[(0.392275482166563,)]

---------

## Finding our top salespeople

As mentioned earlier, we want to find our best salespeople and see whether or not we can incentivize them in an appropriate manner. Namely, we want to determine if the commission percentage we give them motivates them to make more and bigger sales.

### Exercise 5:

Find the top five performing salespeople by using the `salesytd` (Sales, year-to-date) column. (We only need to know the `businessentityid` for each salesperson as this uniquely identifies each.) Why might you be skeptical of these numbers right now?

**Answer.**

In [152]:
%%sql
SELECT p.productsubcategoryid as subcategory, p.name, corr(p.listprice,od.orderqty), sum(od.orderqty) as orders
FROM product as p
INNER JOIN salesorderdetail od ON p.productid = od.productid
GROUP BY subcategory,name
ORDER BY orders DESC
LIMIT 5

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
5 rows affected.

[(19, 'AWC Logo Cap', 1.87188408731233e-07, 8311),
 (28, 'Water Bottle - 30 oz.', 1.0499096253825e-07, 6815),
 (31, 'Sport-100 Helmet, Blue', 1.5610387257478e-07, 6743),
 (21, 'Long-Sleeve Logo Jersey, L', None, 6592),
 (31, 'Sport-100 Helmet, Black', 1.53984124389788e-07, 6532)]

---------

### Exercise 6:

Using ```salesorderheader```, find the top 5 salespeople who made the most sales **in the most recent year** (2014). (There is a column called `subtotal` - use that.) Sales that do not have an associated salesperson should be excluded from your calculations and final output. All orders that were made within the 2014 calendar year should be included.

**Hint:** You can use the syntax `'1970-01-01'::date` to generate an arbitrary date in PostgreSQL and compare this to specific dates in the tables.

**Answer.**

In [153]:
%%sql
SELECT salespersonid, sum(subtotal) sales
FROM salesorderheader
WHERE orderdate >= '2014-01-01'::date and orderdate <= '2014-12-31'::date AND salespersonid is not null
group by salespersonid
order by sales desc
limit 5

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
5 rows affected.

[(289, 1382996.5839),
 (276, 1271088.5216),
 (275, 1057247.3786),
 (282, 1044810.8277),
 (277, 1040093.4071)]

---------

### Exercise 7:

Looking at the documentation, you will see that `subtotal` in the ```salesorderheader``` table is calculated from other tables in the database. To validate this figure (instead of trusting it blindly), let's calculate `subtotal` manually. Using the ```salesorderdetail``` and ```salesorderheader``` tables, calculate the sales for each salesperson for **this past year** (2014) and display results for the top 5 salespeople.

**Hint:** You will have to ```JOIN``` ```salesorderdetail``` on ```salesorderheader``` to get the salesperson, calculate line totals for each sale using appropriate discounts, then sum all the line totals to get the total sale. You will want to use ```WITH``` clauses again to keep things sane.

**Answer.**

In [154]:
%%sql

SELECT sh.salesorderid,sh.subtotal,sum(orderqty*unitprice - unitprice*unitpricediscount)
FROM salesorderheader as sh
INNER JOIN salesorderdetail as sd ON sh.salesorderid = sd.salesorderid
GROUP BY sh.salesorderid,sh.subtotal
limit 10

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
10 rows affected.

[(51312, 2461.55, 2461.55),
 (62094, 53.99, 53.99),
 (72422, 1237.82, 1237.82),
 (67531, 32.28, 32.28),
 (55330, 3430.62, 3430.62),
 (57850, 27.28, 27.28),
 (55241, 60519.9533, 60640.868016),
 (53965, 2316.97, 2316.97),
 (60585, 119.98, 119.98),
 (47353, 38818.229, 38835.989275)]

In [155]:
%%sql
SELECT sh.salespersonid,sum(orderqty*unitprice - unitprice*unitpricediscount) sales
FROM salesorderheader as sh
INNER JOIN salesorderdetail as sd ON sh.salesorderid = sd.salesorderid
WHERE orderdate >= '2014-01-01'::date and orderdate <= '2014-12-31'::date AND salespersonid is not null
group by salespersonid
order by sales desc
limit 5;

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
5 rows affected.

[(289, 1386715.41608899),
 (276, 1279561.852156),
 (275, 1058737.499335),
 (282, 1046909.075232),
 (277, 1041852.709334)]

---------

### Exercise 8:

Using ```corr()```, see if there is a positive relationship between total sales and commission percentage.

**Answer.**

In [156]:
%%sql
SELECT corr(commissionpct,totalsales)
FROM (
	SELECT sh.salespersonid,sp.commissionpct,sum(orderqty*unitprice) totalsales
	FROM salesorderheader as sh
	INNER JOIN salesorderdetail as sd ON sh.salesorderid = sd.salesorderid
	INNER JOIN salesperson as sp ON sh.salespersonid = sp.businessentityid
	GROUP BY sh.salespersonid,sp.commissionpct
) as c;

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
1 rows affected.

[(0.438131838436976,)]

---------

### Exercise 9:

Remember how we mentioned that products were sold in many regions? This is why you had to work with the `culture` value before to get the English language descriptions. To make matters worse, you are told the sales are recorded in **local** currency, so your previous analysis is flawed, and you must convert all amounts to USD if you wish to compare the different salespeople fairly!

Use the `countryregioncurrency` table in combination with the `salesperson` and `salesterritory` ones to figure out the relevant currency symbol for each of the top salespeople.

**Answer.**

In [157]:
%%sql
SELECT sh.salespersonid,sum(orderqty*unitprice - unitprice*unitpricediscount) sales, cc.currencycode, count(*) amountoforders
FROM salesorderheader as sh
INNER JOIN salesorderdetail as sd ON sh.salesorderid = sd.salesorderid
INNER JOIN salesperson as sp ON sh.salespersonid = sp.businessentityid
INNER JOIN salesterritory as st ON sp.territoryid = st.territoryid
INNER JOIN countryregioncurrency as cc ON st.countryregioncode = cc.countryregioncode
WHERE orderdate >= '2014-01-01'::date and orderdate <= '2014-12-31'::date AND salespersonid is not null
group by salespersonid,cc.currencycode
order by sales desc
limit 5;

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
5 rows affected.

[(289, 1386715.416089, 'GBP', 1146),
 (276, 1279561.852156, 'USD', 988),
 (275, 1058737.499335, 'USD', 923),
 (282, 1046909.075232, 'CAD', 791),
 (277, 1041852.709334, 'USD', 1028)]

---------

### Exercise 10:

Now that we have the currency codes associated with each salesperson, redo Exercise 7 to take the currency exchange into account. If there are salespeople in the top 5 that weren't there before, explain why.

**Hint:** The rates in the```currencyrate``` table always go from `FromCurrencyCode=USD` to `ToCurrencyCode=<Desired Currency Code>`, and they are listed every day. When calculating line totals, use the `AverageRate` for that day. You should be able to reuse a lot of Exercise 7.

**Answer.**

In [158]:
%%sql
SELECT sh.salespersonid,sum(orderqty*(unitprice/cr.averagerate) - (unitprice/cr.averagerate)*unitpricediscount) sales
FROM salesorderheader as sh
INNER JOIN salesorderdetail as sd ON sh.salesorderid = sd.salesorderid
INNER JOIN salesperson as sp ON sh.salespersonid = sp.businessentityid
INNER JOIN salesterritory as st ON sp.territoryid = st.territoryid
INNER JOIN countryregioncurrency as cc ON st.countryregioncode = cc.countryregioncode
INNER JOIN currencyrate as cr ON cc.currencycode = cr.tocurrencycode and cr.modifieddate = sh.orderdate
WHERE orderdate >= '2014-01-01'::date and orderdate <= '2014-12-31'::date AND salespersonid is not null
group by salespersonid
order by sales desc
limit 5;

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
5 rows affected.

[(289, 2152168.89629899),
 (290, 847446.027488964),
 (282, 667467.64345142),
 (288, 570656.582238505),
 (286, 322973.474965523)]

---------

### Exercise 11:

How does the correlation from Exercise 8 change once you've adjusted for the currency?

**Answer.**

In [160]:
%%sql
SELECT corr(commissionpct,sales)
FROM (
    
    SELECT sh.salespersonid,sp.commissionpct,sum(orderqty*(unitprice/cr.averagerate) - (unitprice/cr.averagerate)*unitpricediscount) sales
    FROM salesorderheader as sh
    INNER JOIN salesorderdetail as sd ON sh.salesorderid = sd.salesorderid
    INNER JOIN salesperson as sp ON sh.salespersonid = sp.businessentityid
    INNER JOIN salesterritory as st ON sp.territoryid = st.territoryid
    INNER JOIN countryregioncurrency as cc ON st.countryregioncode = cc.countryregioncode
    INNER JOIN currencyrate as cr ON cc.currencycode = cr.tocurrencycode and cr.modifieddate = sh.orderdate
    WHERE orderdate >= '2014-01-01'::date and orderdate <= '2014-12-31'::date AND salespersonid is not null
    group by salespersonid,sp.commissionpct
) as c;

 * postgresql://postgres:***@ds4a-demo-instance.cafebhyakpc4.us-east-2.rds.amazonaws.com/adventuretime
1 rows affected.

[(0.600414130260028,)]

---------